// src/mock/mockVacancies;js
export const mockVacancies = [
  {
    vacancyId: 1,
    title: "Менеджер по продажам интернет-магазина",
    city: "Махачкала",
    salaryMin: 45000,
    salaryMax: 60000,
    description:
      "Требования: Грамотная устная и письменная речь, базовый навык работы с ПК, базовое понятие технических характеристик товаров, желание развиваться, стрессоустойчивость, пунктуальность; Вам предстоит: Принимать и обрабатывать поступающие звонки, проконсультировать клиента, помочь с выбором товара, оформить и провести заказ; Мы предлагаем: График работы скользящий, 5/2, 8-ми часовой рабочий день, оплачиваемый отпуск",
    isNew: false,
  },
  {
    vacancyId: 2,
    title: "Мерчандайзер",
    city: "Хасавюрт",
    salaryMin: 25000,
    salaryMax: 45000,
    description:
      "Требования: Внимательность, ответственность, предприимчивость, энергичность; Знание компьютерной или какой-либо другой техники приветствуется; Желание работать и развиваться в растущей компании; Опыт работы значения не имеет; Вам предстоит: Прием и оприходование товара; Выкладка товара на витрины; Расстановка ценников на товар; Поддержание порядка на витринах; Мы предлагаем: График работы 8-часовой рабочий день, оплачиваемый отпуск; Система обучения и наставничества; Оплачиваемая стажировка; Возможность карьерного и профессионального роста; Обед за счет компании; Библиотека с профессиональной литературой; Комнаты отдыха",
    isNew: false,
  },
  {
    vacancyId: 3,
    title: "Маркетолог",
    city: "Дербент",
    salaryMin: 45000,
    salaryMax: 70000,
    description:
      "Требования: Креативность, системный подход к анализу данных и оптимизации процессов, участие в постановлении процесса; Опыт работы с рекламными кампаниями от брифа до размещения; Базовые понимания в маркетинге и брендинге; Умение анализировать большой объём информации и принимать самостоятельные решения; Высокий уровень самоорганизации, внимательность к деталям, особенно при тестировании кампании и умение анализировать результаты кампании; Создание интересных и ценных элементов рекламной коммуникации; Понимание принципов работы с маркетинговыми инструментами продвижения бренда в каналах коммуникации; Способность работать в команде, давать обратную связь; Вам предстоит: Продвигать и развивать сеть магазинов электроники; Реализация маркетинговой стратегии с командой; Работа с Pos-материалами и оформления зала; Медиа-планирование; Оценка эффективности рекламных кампаний и выбранных инструментов; Подготовка гипотез по улучшению ключевых метрик и оптимизация конверсии; Осуществлять качественный контроль за дедлайнами задач; Выстраивать коммуникации со смежными подразделениями; Запуск промо-акций и рекламных кампаний; Мы предлагаем: Увлекательную работу в современной компании; График работы 5/2; Гибкое утро, 8-ми часовой рабочий день; Оплачиваемый отпуск 28 календарных дней; Собственная кухня в офисе, у нас всегда есть чем подкрепиться; Работа в современном офисе в центре города; Обучение за счет компании; Наставничество; Дружный, профессиональный коллектив",
    isNew: false,
  },
  {
    vacancyId: 4,
    title: "Программист 1С",
    city: "Дагестанские Огни",
    salaryMin: 110000,
    salaryMax: 150000,
    description:
      "Требования: Опыт работы с REST API и понимание основ взаимодействия с http-сервисами; Навыки работы с внешними интеграциями, особенно обмен данными между 1С и сайтом; Уверенное знание и опыт работы на платформе 1С 8.3; Знание алгоритмов и структур данных, умение писать сложные запросы; Опыт работы с существующими конфигурациями, включая их редактирование и развитие; Понимание и использование библиотек 1С (БСП, БПО и др), а также знаний СКД и языка запросов; Гибкость в коммуникациях, способность работать как внутри своей команды, так и с другими отделами; Вам предстоит: Программирование и настройка на базе платформы 1С 8.3; Поддержка и изменение существующих конфигураций; Проектирование архитектуры решений и их интеграций; Разработка интерфейсов, удобных для пользователя; Участие в планировании и обсуждениях задач с коллегами; Поддержка текущих решений и разработка нового функционала для улучшения процессов ритейла; Осуществлять качественный контроль за дедлайнами задач; Выстраивать коммуникации со смежными подразделениями; Запуск промо-акций и рекламных кампаний; Мы предлагаем: Работа в современной продуктовой команде, где ценится профессионализм и обмен знаниями; Возможности для бесплатного обучения у наших партнеров; Реальную возможность влиять на рабочие процессы и вносить свои идеи; Гибкий график работы и возможность удаленной работы; Офисы компании для работы и встреч; Оплачиваемый отпуск, корпоративные мероприятия и спортивные активности; Регулярный пересмотр компенсации с учетом вашего вклада",
    isNew: true,
  },
  {
    vacancyId: 5,
    title: "Доставщик",
    city: "Махачкала",
    salaryMin: 30000,
    salaryMax: 60000,
    description:
      "Требования: Крепкая физическая форма; Пунктуальность, трудолюбие; Ответственное отношение к работе; Вам предстоит: Погрузка, выгрузка товара; Мы предлагаем: График работы: 6/1, с 10.00 до 19.00; Бесплатный обед за счет компании; Оплачиваемый отпуск; Заработная плата: 2000 за смену",
    isNew: false,
  },
  {
    vacancyId: 6,
    title: "Мастер по ремонту компьютерной техники",
    city: "Махачкала",
    salaryMin: 30000,
    salaryMax: 90000,
    description:
      "Требования: Отличные знания компьютеров, ноутбуков и комплектующих к ним; Умение быстро выявить компьютерную неисправность для ее устранения; Честность, пунктуальность, ответственность, порядочность, аккуратность, опрятность; Ответственное отношение к работе; Умение работать с клиентами; Опыт работы в аналогичной сфере обязателен; Вам предстоит: Диагностика, технологический и программный ремонт компьютерной техники; Профессиональное консультирование клиентов; Согласование стоимости с клиентами; Мы предлагаем: График работы 5/2, с 10-00 до 19-00; Передовое оборудование; Оплачиваемый отпуск; Обед за счет организации",
    isNew: false,
  },

  {
    vacancyId: 7,
    title: "Frontend Developer",
    city: "Каспийск",
    salaryMin: 100000,
    salaryMax: 150000,
    description:
      "Разработка интерфейсов на React и TypeScript с использованием современных библиотек и подходов;",
    isNew: true,
  },
  {
    vacancyId: 8,
    title: "Backend Developer",
    city: "Избербаш",
    salaryMin: 120000,
    salaryMax: 180000,
    description:
      "Node;js, SQL Server, REST API; Разработка и поддержка серверной логики;",
    isNew: false,
  },
  {
    vacancyId: 9,
    title: "QA Engineer",
    city: "Буйнакск",
    salaryMin: 80000,
    salaryMax: 110000,
    description: "Тестирование веб-приложений, автоматизация процессов CI/CD;",
    isNew: false,
  },
];
